Revit 2027 API
DockablePane(DockablePane) Constructor
 Constructs a new copy of the input DockablePane object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DockablePane(
	DockablePane other
)
Public Sub New (
	other As DockablePane
)
public:
DockablePane(
	DockablePane^ other
)
new :
        other : DockablePane -> DockablePane
Parameters
other DockablePane
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DockablePane Class
DockablePane Overload
Autodesk.Revit.UI Namespace